
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3820308231)



<pre><code>Apply complete! Resources: 3 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-091988d7ddf7e3026]
data.aws_iam_policy_document.ecs_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e6f077d823b60bc4]
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:761817748648:cluster/go-simple-server]
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/go-simple-server]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a27f353e971c2ce9]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/5e7bbaf49b1c20d5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e59857e48571349c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-052cd82a7138f770c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-097ec36a80fbb0411]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07bad54b06a9de95f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ca74bc2e072bde41]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01ba50848ef3f08a1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d7ba8aeca6cafcc0]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01e80e88b0d927e20]
aws_security_group.ecs: Refreshing state... [id=sg-01cd6c74ce16f9f6b]
aws_security_group.alb: Refreshing state... [id=sg-01510647e997233bd]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-097ec36a80fbb04111080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e426873c0c468e7f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e1e3347b8186c869]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09027a03ff80963bd]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-05d802e00904a823a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f67c94081bec6d2f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-052b7b9597b548d7a]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2780155660]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/go-simple-server-alb/4ca5a3ece509e8f4]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d7ba8aeca6cafcc01080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07bad54b06a9de95f1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/go-simple-server-alb/4ca5a3ece509e8f4/23131a0e05b629d9]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener-rule/app/go-simple-server-alb/4ca5a3ece509e8f4/23131a0e05b629d9/5f609bd3456d8955]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:761817748648:service/go-simple-server/go-simple-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:761817748648:service/go-simple-server/go-simple-server"
        name                               = "go-simple-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/go-simple-server:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.ecs_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/go-simple-server:3" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  - mountPoints      = [] -> null
                    name             = "go-simple-server"
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::761817748648:role/ecsTaskExecutionRole" -> (known after apply) # forces replacement
      ~ id                       = "go-simple-server" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
      ~ task_role_arn            = "arn:aws:iam::761817748648:role/ecsTaskExecutionRole" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.
aws_ecs_task_definition.ecs_task_definition: Destroying... [id=go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Destruction complete after 1s
aws_iam_role.ecs: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs_task: Creation complete after 1s [id=go-simple-server-ecs-task]
aws_iam_role.ecs: Creation complete after 1s [id=go-simple-server-ecs]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=go-simple-server]
aws_ecs_service.ecs_service: Modifying... [id=arn:aws:ecs:ap-northeast-1:761817748648:service/go-simple-server/go-simple-server]
aws_ecs_service.ecs_service: Modifications complete after 1s [id=arn:aws:ecs:ap-northeast-1:761817748648:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":16,"Program":"tfcmt","SHA1":"15451d0154eae77a1a807524b4cdf55ae89779b9","Vars":{},"WorkflowName":"Terraform"} -->